import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter/rendering.dart';

void main() {
  runApp(MyApp());
}

class MyApp extends StatefulWidget {
  @override
  _MyAppState createState() => _MyAppState();
}

class _MyAppState extends State<MyApp> {
  bool themeSwitch = false;

  dynamic themeColors() {
    if (themeSwitch) {
      return Colors.brown;
    } else {
      return Colors.grey[850];
    }
  }

  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      home: Scaffold(
        appBar: AppBar(
          title: Text('ပဋ္ဌာန်း တရားတော်'),
          backgroundColor: themeColors(),
          elevation: 0,
          brightness: themeSwitch ? Brightness.dark : Brightness.light,
          leading: IconButton(
            onPressed: () {
              setState(() {
                themeSwitch = !themeSwitch;
              });
            },
            icon: themeSwitch
                ? Icon(
                    Icons.brightness_3,
                    color: Colors.white,
                  )
                : Icon(
                    Icons.wb_sunny,
                    color: Colors.amber,
                  ),
          ),
        ),

        body: Container(
          color: themeSwitch ? Colors.white70 : Colors.black,
          child: SingleChildScrollView(
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                //ဟေတုပစ္စယောတိ
                Text('၁။ ဟေတုပစ္စယ'),
                Text('ဟေတုပစ္စယောတိ'),
                Text('ဟေတူ ဟေတုသမ္ပယုတ္တကာနံ ဓမ္မာနံ'),
                Text('တံသမုဋ္ဌာနာနဉ္စ ရူပါနံ ဟေတုပစ္စယေန ပစ္စယော။'),
                Text(''),
                //အာရမ္မဏပစ္စယောတိ
                Text('၂။ အာရမ္မဏပစ္စယ'),
                Text('အာရမ္မဏပစ္စယောတိ'),
                Text('ရူပါယတနံ စက္ခုဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အာရမ္မဏပစ္စယေန ပစ္စယော။'),
                Text('သဒ္ဒါယတနံ သောတဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အာရမ္မဏပစ္စယေန ပစ္စယော။'),
                Text('ဂန္ဓာယတနံ ဃာနဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အာရမ္မဏပစ္စယေန ပစ္စယော။'),
                Text('ရသာယတနံ ဇိဝှာဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အာရမ္မဏပစ္စယေန ပစ္စယော။'),
                Text('ဖောဋ္ဌဗ္ဗာယတနံ ကာယဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အာရမ္မဏပစ္စယေန ပစ္စယော။'),
                Text('ရူပါယတနံ သဒ္ဒါယတနံ ဂန္ဓာယတနံ ရသာယတနံ ဖောဋ္ဌဗ္ဗာယတနံ'),
                Text(
                    'မနောဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အာရမ္မဏပစ္စယေန ပစ္စယော။'),
                Text('သဗ္ဗေ ဓမ္မာ မနောဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အာရမ္မဏပစ္စယေန ပစ္စယော။'),
                Text('ယံ ယံ ဓမ္မံ အာရဗ္ဘ ယေ ယေ ဓမ္မာ ဥပ္ပဇ္ဇန္တိ'),
                Text('စိတ္တစေတသိ ကာ ဓမ္မာ၊'),
                Text('တေ တေ ဓမ္မာ တေသံ တေသံ ဓမ္မာနံ အာရမ္မဏပစ္စယေန ပစ္စယော။'),
                Text(''),
                //အဓိပတိပစ္စယောတိယ
                Text('၃။ အဓိပတိပစ္စယ'),
                Text('အဓိပတိပစ္စယောတိ'),
                Text('ဆန္ဒာဓိပတိ ဆန္ဒသမ္ပယုတ္တကာနံ ဓမ္မာနံ'),
                Text('တံသမုဋ္ဌာနာနဉ္စ ရူပါနံ အဓိပတိပစ္စယေန ပစ္စယော။'),
                Text('ဝီရိယာဓိပတိ ဝီရိယသမ္ပယုတ္တကာနံ ဓမ္မာနံ'),
                Text('တံသမုဋ္ဌာနာနဉ္စ ရူပါနံ အဓိပတိပစ္စယေန ပစ္စယော။'),
                Text('စိတ္တာဓိပတိ စိတ္တသမ္ပယုတ္တကာနံ ဓမ္မာနံ'),
                Text('တံသမုဋ္ဌာနာနဉ္စ ရူပါနံ အဓိပတိပစ္စယေန ပစ္စယော။'),
                Text('ဝီမံသာဓိပတိ ဝီမံသသမ္ပယုတ္တကာနံ ဓမ္မာနံ'),
                Text('တံသမုဋ္ဌာနာနဉ္စ ရူပါနံ အဓိပတိပစ္စယေန ပစ္စယော။'),
                Text('ယံ ယံ ဓမ္မံ ဂရုံ ကတွာ'),
                Text('ယေ ယေ ဓမ္မာ ဥပ္ပဇ္ဇန္တိ စိတ္တစေတသိ ကာ ဓမ္မာ၊'),
                Text('တေ တေ ဓမ္မာ တေသံ တေသံ ဓမ္မာနံ အဓိပတိပစ္စယေန ပစ္စယော။'),
                Text(''),
                //အနန္တရပစ္စယောတိ
                Text('၄။ အနန္တရပစ္စယ'),
                Text('အနန္တရပစ္စယောတိ'),
                Text('စက္ခုဝိညာဏဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('မနောဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဝိညာဏဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('သောတဝိညာဏဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('မနောဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဝိညာဏဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ဃာနဝိညာဏဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('မနောဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဝိညာဏဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ဇိဝှါဝိညာဏဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('မနောဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဝိညာဏဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ကာယဝိညာဏဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('မနောဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဝိညာဏဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ ကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ ကုသလာနံ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ ကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အဗျာကတာနံ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အကုသလာနံ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အဗျာကတာနံ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အဗျာကတာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အဗျာကတာနံ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အဗျာကတာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ ကုသလာနံ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အဗျာကတာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အကုသလာနံ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ယေသံ ယေသံ ဓမ္မာနံ အနန္တရာ'),
                Text('ယေ ယေ ဓမ္မာ ဥပ္ပဇ္ဇန္တိ စိတ္တစေတသိ ကာ ဓမ္မာ၊'),
                Text('တေ တေ ဓမ္မာ တေသံ တေသံ ဓမ္မာနံ အနန္တရပစ္စယေန ပစ္စယော။'),
                Text(''),
                //သမနန္တရပစ္စယောတိ
                Text('၅။ သမနန္တရပစ္စယ'),
                Text('သမနန္တရပစ္စယောတိ'),
                Text('စက္ခုဝိညာဏဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('မနောဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဝိညာဏဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('သောတဝိညာဏဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('မနောဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဝိညာဏဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ဃာနဝိညာဏဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('မနောဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဝိညာဏဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ဇိဝှါဝိညာဏဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('မနောဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဝိညာဏဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော'),
                Text('ကာယဝိညာဏဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('မနောဓာတု တံသမ္ပယုတ္တကာ စ ဓမ္မာ'),
                Text(
                    'မနောဝိညာဏဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ ကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ ကုသလာနံ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ ကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အဗျာကတာနံ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အကုသလာနံ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အဗျာကတာနံ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အဗျာကတာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အဗျာကတာနံ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အဗျာကတာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ ကုသလာနံ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အဗျာကတာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အကုသလာနံ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text('ယေသံ ယေသံ ဓမ္မာနံ သမနန္တရာ'),
                Text('ယေ ယေ ဓမ္မာ ဥပ္ပဇ္ဇန္တိ စိတ္တစေတသိ ကာ ဓမ္မာ၊'),
                Text('တေ တေ ဓမ္မာ တေသံ တေသံ ဓမ္မာနံ သမနန္တရပစ္စယေန ပစ္စယော။'),
                Text(''),
                //သဟဇာတပစ္စယောတိ
                Text('၆။ သဟဇာတပစ္စယ'),
                Text('သဟဇာတပစ္စယောတိ'),
                Text('စတ္တာရော ခန္ဓာ အရူပိနော အညမညံ'),
                Text('သဟဇာတပစ္စယေန ပစ္စယော။'),
                Text('စတ္တာရော မဟာဘူတာ အညမညံ'),
                Text('သဟဇာတပစ္စယေန ပစ္စယော။'),
                Text('ဩက္ကန္တိက္ခဏေ နာမရူပံ အညမညံ'),
                Text('သဟဇာတပစ္စယေန ပစ္စယော။'),
                Text('စိတ္တစေတသိကာ ဓမ္မာ'),
                Text('စိတ္တသမုဋ္ဌာနာနံ ရူပါနံ သဟဇာတပစ္စယေန ပစ္စယော။'),
                Text('မဟာဘူတာ ဥပါဒါရူပါနံ သဟဇာတပစ္စယေန ပစ္စယော။'),
                Text('ရူပိနော ဓမ္မာ အရူပီနံ ဓမ္မာနံ'),
                Text('ကိဉ္စိကာလေ သဟဇာတပစ္စယေန ပစ္စယော၊'),
                Text('ကိဉ္စိကာလေ န သဟဇာတပစ္စယေန ပစ္စယော။'),
                Text(''),
                //အညမညပစ္စယောတိ
                Text('၇။ အညမညပစ္စယ'),
                Text('အညမညပစ္စယောတိ'),
                Text('စတ္တာရော ခန္ဓာ အရူပိနော'),
                Text('အညမညပစ္စယေန ပစ္စယော။'),
                Text('စတ္တာရော မဟာဘူတာ'),
                Text('အညမညပစ္စယေန ပစ္စယော။'),
                Text('ဩက္ကန္တိက္ခဏေ နာမရူပံ'),
                Text('အညမညပစ္စယေန ပစ္စယော။'),
                Text(''),
                //နိဿယပစ္စယောတိ
                Text('၈။ နိဿယပစ္စယ'),
                Text('နိဿယပစ္စယောတိ'),
                Text('စတ္တာရော ခန္ဓာ အရူပိနော အညမညံ'),
                Text('နိဿယပစ္စယေန ပစ္စယော။'),
                Text('စတ္တာရော မဟာဘူတာ အညမညံ'),
                Text('နိဿယပစ္စယေန ပစ္စယော။'),
                Text('ဩက္ကန္တိက္ခဏေ နာမရူပံ အညမညံ'),
                Text('နိဿယပစ္စယေန ပစ္စယော။'),
                Text('စိတ္တစေတသိကာ ဓမ္မာ'),
                Text('စိတ္တသမုဋ္ဌာနာနံ ရူပါနံ နိဿယပစ္စယေန ပစ္စယော။'),
                Text('မဟာဘူတာ ဥပါဒါရူပါနံ နိဿယပစ္စယေန ပစ္စယော။'),
                Text('စက္ခာယတနံ စက္ခုဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ နိဿယပစ္စယေန ပစ္စယော။'),
                Text('သောတယတနံ သောတဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ နိဿယပစ္စယေန ပစ္စယော။'),
                Text('ဃာနာယတနံ ဃာနဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ နိဿယပစ္စယေန ပစ္စယော။'),
                Text('ဇိဝှါယတနံ ဇိဝှါဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ နိဿယပစ္စယေန ပစ္စယော။'),
                Text('ကာယာယတနံ ကာယဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ နိဿယပစ္စယေန ပစ္စယော။'),
                Text('ယံ ရူပံ နိဿာယ မနောဓာတု စ မနောဝိညာဏဓာတု စ ဝတ္တန္တိ၊'),
                Text('တံ ရူပံ မနောဓာတုယာ စ မနောဝိညာဏဓာတုယာ စ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ နိဿယပစ္စယေန ပစ္စယော။'),
                Text(''),
                //ဥပနိဿယပစ္စယောတိ
                Text('၉။ ဥပနိဿယပစ္စယ'),
                Text('ဥပနိဿယပစ္စယောတိ'),
                Text('ပုရိမာ ပုရိမာ ကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ ကုသလာနံ ဓမ္မာနံ ဥပနိဿယပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ ကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အကုသလာနံ ဓမ္မာနံ ကေသဉ္စိ ဥပနိဿယပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ ကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အဗျာကတာနံ ဓမ္မာနံ ဥပနိဿယပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အကုသလာနံ ဓမ္မာနံ ဥပနိဿယပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ ကုသလာနံ ဓမ္မာနံ ကေသဉ္စိ ဥပနိဿယပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အဗျာကတာနံ ဓမ္မာနံ ဥပနိဿယပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အဗျာကတာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အဗျာကတာနံ ဓမ္မာနံ ဥပနိဿယပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အဗျာကတာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ ကုသလာနံ ဓမ္မာနံ ဥပနိဿယပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အဗျာကတာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အကုသလာနံ ဓမ္မာနံ ဥပနိဿယပစ္စယေန ပစ္စယော။'),
                Text('ဥတု ဘောဇနမ္ပိ ဥပနိဿယပစ္စယေန ပစ္စယော။'),
                Text('ပုဂ္ဂလောပိ ဥပနိဿယပစ္စယေန ပစ္စယော။'),
                Text('သေနာသနမ္ပိ ဥပနိဿယပစ္စယေန ပစ္စယော။'),
                Text(''),
                //ပုရေဇာတပစ္စယောတိ
                Text('၁၀။ ပုရေဇာတပစ္စယ'),
                Text('ပုရေဇာတပစ္စယောတိ'),
                Text('စက္ခာယတနံ စက္ခုဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ပုရေဇာတပစ္စယေန ပစ္စယော။'),
                Text('သောတာယတနံ သောတဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ပုရေဇာတပစ္စယေန ပစ္စယော။'),
                Text('ဃာနာယတနံ ဃာနဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ပုရေဇာတပစ္စယေန ပစ္စယော။'),
                Text('ဇိဝှါယတနံ ဇိဝှါဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ပုရေဇာတပစ္စယေန ပစ္စယော။'),
                Text('ကာယာယတနံ ကာယဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ပုရေဇာတပစ္စယေန ပစ္စယော။'),
                Text('ရူပါယတနံ စက္ခုဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ပုရေဇာတပစ္စယေန ပစ္စယော။'),
                Text('သဒ္ဒါယတနံ သောတဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ပုရေဇာတပစ္စယေန ပစ္စယော။'),
                Text('ဂန္ဓာယတနံ ဃာနဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ပုရေဇာတပစ္စယေန ပစ္စယော။'),
                Text('ရသာယတနံ ဇိဝှါဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ပုရေဇာတပစ္စယေန ပစ္စယော။'),
                Text('ဖောဋ္ဌဗ္ဗာယတနံ ကာယဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ပုရေဇာတပစ္စယေန ပစ္စယော။'),
                Text('ရူပါယတနံ သဒ္ဒါယတနံ ဂန္ဓာယတနံ ရသာယတနံ ဖောဋ္ဌဗ္ဗာယတနံ'),
                Text(
                    'မနောဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ပုရေဇာတပစ္စယေန ပစ္စယော။'),
                Text('ယံ ရူပံ နိဿာယ'),
                Text('မနောဓာတု စ မနောဝိညာဏဓာတု စ ဝတ္တန္တိ၊'),
                Text('တံ ရူပံ မနောဓာတုယာ တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ'),
                Text('ပုရေဇာတပစ္စယေန ပစ္စယော။'),
                Text('မနောဝိညာဏဓာတုယာ'),
                Text(
                    'တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ကိဉ္စိကာလေ ပုရေဇာတပစ္စယေန ပစ္စယော၊'),
                Text('ကိဉ္စိကာလေ န ပုရေဇာတပစ္စယေန ပစ္စယော။'),
                Text(''),
                //ပစ္ဆာဇာတပစ္စယောတိ
                Text('၁၁။ ပစ္ဆာဇာတပစ္စယ'),
                Text('ပစ္ဆာဇာတပစ္စယောတိ'),
                Text('ပစ္ဆာဇာတာ စိတ္တစေတသိကာ ဓမ္မာ'),
                Text('ပုရေဇာတဿ ဣမဿ ကာယဿ ပစ္ဆာဇာတပစ္စယေန ပစ္စယော။'),
                Text(''),
                //အာသေဝနပစ္စယောတိ
                Text('၁၂။ အာသေဝနပစ္စယ'),
                Text('အာသေဝနပစ္စယောတိ'),
                Text('ပုရိမာ ပုရိမာ ကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ ကုသလာနံ ဓမ္မာနံ အာသေဝနပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ အကုသလာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ အကုသလာနံ ဓမ္မာနံ အာသေဝနပစ္စယေန ပစ္စယော။'),
                Text('ပုရိမာ ပုရိမာ ကိရိယာဗျာကတာ ဓမ္မာ'),
                Text(
                    'ပစ္ဆိမာနံ ပစ္ဆိမာနံ ကိရိယာဗျာကတာနံ ဓမ္မာနံ အာသေဝနပစ္စယေန ပစ္စယော။'),
                Text(''),
                //ကမ္မပစ္စယောတိ
                Text('၁၃။ ကမ္မပစ္စယ'),
                Text('ကမ္မပစ္စယောတိ'),
                Text('ကုသလာကုသလံ ကမ္မံ ဝိပါကာနံ ခန္ဓာနံ'),
                Text('ကဋတ္တာ စ ရူပါနံ ကမ္မပစ္စယေန ပစ္စယော။'),
                Text('စေတနာ သမ္ပယုတ္တကာနံ ဓမ္မာနံ'),
                Text('တံသမုဋ္ဌာနာနဉ္စ ရူပါနံ ကမ္မပစ္စယေန ပစ္စယော။'),
                Text(''),
                //ဝိပါကပစ္စယောတိ
                Text('၁၄။ ဝိပါကပစ္စယ'),
                Text('ဝိပါကပစ္စယောတိ'),
                Text('ဝိပါကာစတ္တာရော ခန္ဓာ အရူပိနော'),
                Text('အညမညံ ဝိပါကပစ္စယေန ပစ္စယော။'),
                Text(''),
                //အာဟာရပစ္စယောတိ
                Text('၁၅။ အာဟာရပစ္စယ'),
                Text('အာဟာရပစ္စယောတိ'),
                Text('ကဗဠီကာရော အာဟာရေ'),
                Text('ဣမဿ ကာယဿ အာဟာရပစ္စယေန ပစ္စယော။'),
                Text('အရူပိနော အာဟာရာ သမ္ပယုတ္တကာနံ ဓမ္မာနံ'),
                Text('တံသမုဋ္ဌာနာနဉ္စ ရူပါနံ အာဟာရပစ္စယေန ပစ္စယော။'),
                Text(''),
                //ဣန္ဒြိယပစ္စယောတိ
                Text('၁၆။ ဣန္ဒြိယပစ္စယ'),
                Text('ဣန္ဒြိယပစ္စယောတိ'),
                Text('စက္ခုန္ဒြိယံ စက္ခုဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ဣန္ဒြိယပစ္စယေန ပစ္စယော။'),
                Text('သောတိန္ဒြိယံ သောတဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ဣန္ဒြိယပစ္စယေန ပစ္စယော။'),
                Text('ဃာနိန္ဒြိယံ ဃာနဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ဣန္ဒြိယပစ္စယေန ပစ္စယော။'),
                Text('ဇိဝှိန္ဒြိယံ ဇိဝှာဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ဣန္ဒြိယပစ္စယေန ပစ္စယော။'),
                Text('ကာယိန္ဒြိယံ ကာယဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ ဣန္ဒြိယပစ္စယေန ပစ္စယော။'),
                Text('ရူပဇီဝိတိန္ဒြိယံ ကဋတ္တာရူပါနံ ဣန္ဒြိယပစ္စယေန ပစ္စယော။'),
                Text('အရူပိနော ဣန္ဒြိယာ သမ္ပယုတ္တကာနံ ဓမ္မာနံ'),
                Text('တံသမုဋ္ဌာနာနဉ္စ ရူပါနံ ဣန္ဒြိယပစ္စယေန ပစ္စယော။'),
                Text(''),
                //၁၇။ ဈာနပစ္စယောတိ
                Text('၁၇။ ဈာနပစ္စယ'),
                Text('ဈာနပစ္စယောတိ'),
                Text('ဈာနင်္ဂါနိ ဈာနသမ္ပယုတ္တကာနံ ဓမ္မာနံ'),
                Text('တံသမုဋ္ဌာနာနဉ္စ ရူပါနံ ဈာနပစ္စယေန ပစ္စယော။'),
                Text(''),
                //မဂ္ဂပစ္စယောတိ
                Text('၁၈။ မဂ္ဂပစ္စယ'),
                Text('မဂ္ဂပစ္စယောတိ'),
                Text('မဂ္ဂင်္ဂါနိ မဂ္ဂသမ္ပယုတ္တကာနံ ဓမ္မာနံ'),
                Text('တံသမုဋ္ဌာနာနဉ္စ ရူပါနံ မဂ္ဂပစ္စယေန ပစ္စယော။'),
                Text(''),
                //သမ္ပယုတ္တပစ္စယောတိ
                Text('၁၉။ သမ္ပယုတ္တပစ္စယ'),
                Text('သမ္ပယုတ္တပစ္စယောတိ'),
                Text('စတ္တာရော ခန္ဓာ အရူပိနော'),
                Text('အညမညံ သမ္ပယုတ္တပစ္စယေန ပစ္စယော။'),
                Text(''),
                //ဝိပ္ပယုတ္တပစ္စယောတိ
                Text('၂၀။ ဝိပ္ပယုတ္တပစ္စယ'),
                Text('ဝိပ္ပယုတ္တပစ္စယောတိ'),
                Text('ရူပိနော ဓမ္မာ အရူပီနံ ဓမ္မာနံ'),
                Text('ဝိပယုတ္တပစ္စယေန ပစ္စယော။'),
                Text('အရူပိနော ဓမ္မာ ရူပီနံ ဓမ္မာနံ'),
                Text('ဝိပယုတ္တပစ္စယေန ပစ္စယော။'),
                Text(''),
                //အတ္ထိပစ္စယောတိ
                Text('၂၁။ အတ္ထိပစ္စယ'),
                Text('အတ္ထိပစ္စယောတိ'),
                Text('စတ္တာရော ခန္ဓာ အရူပိနော အညမညံ'),
                Text('အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('စတ္တာရော မဟာဘူတာ အညမညံ'),
                Text('အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('ဩက္ကန္တိက္ခဏေ နာမရူပံ အညမညံ'),
                Text('အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('စိတ္တစေတသိကာ ဓမ္မာ'),
                Text('စိတ္တသမုဋ္ဌာနာနံ ရူပါနံ အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('မဟာဘူတာ ဥပါဒါရူပါနံ အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('စက္ခာယတနံ စက္ခုဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('သောတာယတနံ သောတဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('ဃာနာယတနံ ဃာနဝိညာဏ ဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('ဇိဝှါယတနံ ဇိဝှါဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('ကာယာယတနံ ကာယဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('ရူပါယတနံ စက္ခုဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('သဒ္ဒါယတနံ သောတဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('ဂန္ဓာယတနံ ဃာနဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('ရသာယတနံ ဇိဝှါဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('ဖောဋ္ဌဗ္ဗာယတနံ ကာယဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('ရူပါယတနံ သဒ္ဒါယတနံ ဂန္ဓာယတနံ ရသာယတနံ ဖောဋ္ဌဗ္ဗာယတနံ'),
                Text(
                    'မနောဓာတုယာ တံ သမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text('ယံ ရူပံ နိဿာယ'),
                Text('မနောဓာတု စ မနောဝိညာဏဓာတု စ ဝတ္တန္တိ၊'),
                Text('တံ ရူပံ မနောဓာတုယာ စ မနောဝိညာဏ ဓာတုယာ စ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အတ္ထိပစ္စယေန ပစ္စယော။'),
                Text(''),
                //နတ္တိပစ္စယောတိ
                Text('၂၂။ နတ္တိပစ္စယ'),
                Text('နတ္တိပစ္စယောတိ'),
                Text('သမနန္တရနိရုဒ္ဓါ စိတ္တစေတသိကာ ဓမ္မာ'),
                Text(
                    'ပဋုပ္ပန္နာနံ စိတ္တစေတသိကာနံ ဓမ္မာနံ နတ္ထိပစ္စယေန ပစ္စယော။'),
                Text(''),
                //ဝိဂတပစ္စယောတိ
                Text('၂၃။ ဝိဂတပစ္စယ'),
                Text('ဝိဂတပစ္စယောတိ'),
                Text('သမနန္တရဝိဂတာ စိတ္တစေတသိကာ ဓမ္မာ'),
                Text(
                    'ပဋုပ္ပန္နာနံ စိတ္တစေတသိကာနံ ဓမ္မာနံ ဝိဂတပစ္စယေန ပစ္စယော။'),
                Text(''),
                //အဝိဂတပစ္စယောတိ
                Text('၂၄။ အဝိဂတပစ္စယ'),
                Text('အဝိဂတပစ္စယောတိ'),
                Text('စတ္တာရော ခန္ဓာ အရူပိနော အညမညံ'),
                Text('အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('စတ္တာရော မဟာဘူတာ အညမညံ'),
                Text('အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('ဩက္ကန္တိက္ခဏေ နာမရူပံ အညမညံ'),
                Text('အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('စိတ္တစေတသိကာ ဓမ္မာ'),
                Text('စိတ္တသမုဋ္ဌာနာနံ ရူပါနံ အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('မဟာဘူတာ ဥပါဒါရူပါနံ အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('စက္ခာယတနံ စက္ခုဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('သောတာယတနံ သောတဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('ဃာနာယတနံ ဃာနဝိညာဏ ဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('ဇိဝှါယတနံ ဇိဝှါဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('ကာယာယတနံ ကာယဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('ရူပါယတနံ စက္ခုဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('သဒ္ဒါယတနံ သောတဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('ဂန္ဓာယတနံ ဃာနဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('ရသာယတနံ ဇိဝှါဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('ဖောဋ္ဌဗ္ဗာယတနံ ကာယဝိညာဏဓာတုယာ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('ရူပါယတနံ သဒ္ဒါယတနံ ဂန္ဓာယတနံ ရသာယတနံ ဖောဋ္ဌဗ္ဗာယတနံ'),
                Text(
                    'မနောဓာတုယာ တံ သမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text('ယံ ရူပံ နိဿာယ'),
                Text('မနောဓာတု စ မနောဝိညာဏဓာတု စ ဝတ္တန္တိ၊'),
                Text('တံ ရူပံ မနောဓာတုယာ စ မနောဝိညာဏ ဓာတုယာ စ'),
                Text('တံသမ္ပယုတ္တကာနဉ္စ ဓမ္မာနံ အဝိဂတပစ္စယေန ပစ္စယော။'),
                Text(''),
              ],
            ),
          ),
        ),
      ),
      theme: ThemeData(
        brightness: themeSwitch ? Brightness.light : Brightness.dark,
      ),
    );
  }
}
